app/views/dares/challenged.html.erb

SELECT  "dares".* FROM "dares"  ORDER BY "dares"."id" ASC LIMIT 1
---
<ul class="list-group">
  <% if @user.challenged_dares.empty? %>