app/controllers/charities_controller.rb

SELECT  "charities".* FROM "charities" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "charities"
---
  def index
    @charities = Charity.paginate(page: params[:page], :per_page => 10)