app/controllers/dares_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."dare_id" = $1  ORDER BY "videos"."id" ASC LIMIT 1  [["dare_id", 8]]
SELECT "donations".* FROM "donations" WHERE "donations"."pledged_dare_id" = $1  [["pledged_dare_id", 8]]
---
  def show
    # DareDisabler.perform_in(1.minute, @dare.id)
    @proposer = @dare.proposer
    @daree = @dare.daree
    @pledgers = @dare.pledgers
    @comment = Comment.new
    @pledged = @dare.donations.inject(0) { |sum, donation| sum + donation.donation_amount }

    @video = Video.where(dare_id: @dare.id).first