app/controllers/generate_dares_controller.rb

  def generate
    generate_dare = GenerateDare.order("RANDOM()").first
---
SELECT  "generate_dares".* FROM "generate_dares"  ORDER BY RANDOM() LIMIT 1