app/controllers/pending_dares_controller.rb

SELECT  "pending_dares".* FROM "pending_dares" WHERE "pending_dares"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @pending_dare = PendingDare.find(params[:id])

INSERT INTO "pending_dares" ("title", "description", "twitter_handle", "proposer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @pending_dare = PendingDare.new(pend_params)
    @pending_dare.proposer = current_user
    if @pending_dare.save