app/controllers/users_controller.rb

SELECT  "dares".* FROM "dares"  ORDER BY "dares"."id" ASC LIMIT 1
---
  def show
    @relationship = Relationship.where(followee_id: params[:id], follower_id: current_user.id) if current_user
    @followees = @user.followees
    @sample_dare = Dare.first

SELECT "users".* FROM "users" WHERE (username LIKE '%sg%')
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @pending_dare = PendingDare.new
    if params[:phrase]
      @users = User.where("username LIKE ?", "%#{params[:phrase]}%")
      render json: @users.to_json, only: [:username, :image_url, :id]
    else
      @users = User.paginate(page: params[:page], :per_page => 30)